Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/before_your_baby_is_born/choices_in_antenatal_care.html.txt.tmx
Source language: en
Languages: ga

source: Choices in antenatal care
ga: Roghanna i gCúram Réamhbhreithe (Roimh an mBreith)

source: If you think you are pregnant, the first step is to visit your GP
ga: Má cheapann tú go bhfuil tú torrach, is é an chéad chéim ná cuairt a thabhairt ar do Dhochtúir Teaghlaigh

source: You may already have completed a pregnancy test
ga: D'fhéadfadh tástáil toirchis a bheith déanta cheana féin agat

source: They will do some preliminary tests, such as taking your blood, and will use the date of your last monthly period to estimate the date the baby is due (the due date)
ga: Déanfaidh an dochtúir roinnt tástálacha tosaigh, mar sampla fola a thógáil, agus úsáidfidh sé/sí dáta d'fhuil mhíostúil dheireanach leis an dáta a mbeifear ag súil le do leanbh a mheas

source: They will then discuss your plans for antenatal care
ga: Pléifidh siad ansin do phleananna do chúram réamhbhreithe

source: Your GP will then provide you with a 'letter of referral' to the maternity hospital if that is where you opt to have your baby
ga: Tabharfaidh do dhochtúir teaghlaigh "litir chur ar aghaidh" chuig ospidéal máithreachais duit más ann is mian leat do leanbh a bheith agat

source: (Not all hospitals insist on a letter of referral)
ga: (Ní éilíonn gach ospidéal litir chur ar aghaidh)

source: If you wish to have your baby at home, you can read our document on home birth
ga: Más mian leat do leanbh a bheith agat sa bhaile, tá tuilleadh faisnéise inár doiciméad, Breith bhaile

source: You may opt for services under the Maternity and Infant Care Scheme, which is a system of combined care, split between your general practitioner and a maternity unit / hospital obstetrician
ga: Féadfaidh tú seirbhísí a thoghadh de réir na Scéime Máithreachais agus Linbh, atá ina chóras cúraim cónasctha, roinnte idir do ghnáthdhochtúir agus cnáimhseoir ospidéil/aonaid máithreachais

source: Alternatively, you may choose to visit the hospital's antenatal clinic, either as a public, semi-private or private patient
ga: Ar mhalairt slí, d'fhéadfá roghnú cuairt a thabhairt ar chlinic réamhbhreithe an ospidéil, bíodh sin mar othar poiblí, leathphríobháideach nó príobháideach

source: All expectant mothers who are ordinarily resident in the State are entitled to free maternity care, covering antenatal visits, labour and delivery and postnatal care
ga: Tá gach bean toircheasach, a chónaíonn sa Stát de ghnáth, i dteideal cúram máithreachais saor in aisce, a chumhdaíonn cuairteanna réamhbhreithe, luí seoil agus toirbhirt agus cúram iarbhreithe

source: When you ring the hospital to make your first appointment, you will be asked if you intend to visit as a public, semi-private or private patient
ga: Nuair a ghlaonn tú ar an ospidéal le do chéad choinne a dhéanamh, iarrfar ort an bhfuil sé i gceist agat an chuairt a dhéanamh mar othar poiblí, leathphríobháideach nó príobháideach

source: If you are a public patient, you will attend the hospital's antenatal clinic (or hospital clinics based in the community)
ga: Más othar poiblí tú, beidh tú ag freastal ar chlinic réamhbhreithe an ospidéil (nó clinicí ospidéil lonnaithe sa phobal)

source: You may see the same doctor on each visit, or you may not
ga: D'fhéadfadh sé gurb iad an dochtúir céanna a bheadh ann ag gach cuairt, nó d'fhéadfadh sé nach é/í

source: Alternatively, if your pregnancy is uncomplicated, you may elect to visit the midwives' clinic if the hospital has one
ga: Ar mhalairt slí, mura mbaineann aon deacrachtaí le do thoircheas, d'fhéadfá cuairt ar chlinic na mban cnáimhseach a roghnú má tá ceann ag an ospidéal

source: This is staffed by experienced midwives and again, can ensure you continuity of care
ga: Is foireann ban cnáimhseach a bhfuil taithí acu a bhíonn ansin agus arís, cinnteoidh siad leanúnacht cúraim duit

source: When you come into the hospital for labour and delivery, you will be delivered by staff midwives and may not see a doctor unless you experience complications
ga: Nuair a thagann tú isteach san ospidéal i gcomhair luí seoil agus toirbhearta, toirbhireoidh foireann ban cnáimhseach an leanbh agus is féidir leo gan dul chuig dochtúir nó go dtarlódh go mbeadh deacrachtaí agat

source: You may not have met the midwives or doctors who attend your labour and delivery
ga: D'fhéadfadh sé nár chas tú cheana leis na mná chabhrach ná na dochtúirí a bheidh ag freastal ar do luí seoil agus do thoirbhirt

source: After the birth of your baby, you will be moved to the public ward for your stay, generally about 3 days
ga: Tar éis bhreith do linbh, cuifear chuig barda poiblí tú don achar a bheidh tú istigh, go ginearálta thart ar 3 lá

source: A small number of hospitals now offer early discharge schemes, allowing you to go home early from hospital with follow-up care
ga: Tairgeann líon beag ospidéal scéimeanna scaoileadh luath abhaile anois, a cheadaíonn duit dul abhaile go luath ón ospideál agus cúram leanta a fháil

source: For details, please contact your local hospital or consult the Cuidiú Consumer Guide to Maternity Services in Ireland
ga: I gcomhair mionsonraí, déan teagmháil le do thoil le d'ospidéal nó féach ar Threoir Tomhaltóra Chuidiú i leith Seirbhísí Máithreachais in Éirinn

source: Semi-private and private care
ga: Cúram leathphríobháideach agus príobháideach

source: If you are attending as a semi-private patient, you may see a consultant privately, or attend the semi-private clinic
ga: Má bhíonn tú ag freastal mar othar leathphríobháideach, is féidir leat comhairleoir a fheiceáil go príobháideach, nó freastal ar chlinic leathphríobháideach

source: This clinic is run by the consultant and their team
ga: Ritheann comhairleoir agus a fhoireann/foireann an chlinic sin

source: In some hospitals a team member may deliver your baby, or the doctor on duty at the time
ga: I roinnt ospidéal d’fhéadfadh sé gur comhalta den fhoireann a thoirbhireodh do naíonán, nó an dochtúir a bheadh ar dualgas ag an am

source: After delivery, you will stay on a semi-private ward, with approximately 3-5 other mothers
ga: Tar éis na toirbhearta, fanfaidh tú i mbarda leathphríobháideach, ina mbeidh thart ar 3-5 máthair eile

source: If you are attending privately, you will be appointed your own consultant whom you will see at each visit
ga: Má bhíonn tú ag freastal go príobháideach, tabharfar do chomhairleoir féin duit a fheicfidh tú ag gach cuairt

source: Your consultant may not necessarily be available to deliver your baby
ga: Ní gá go mbeadh an comhairleoir sin ar fáil do thoirbhirt do naíonáin

source: Private care also entitles you to a private room, although, again, this is dependent on availability
ga: Bíonn tú i dteideal seomra príobháideach a fháil chomh maith de bharr cúraim phríobháidigh, ach, arís, braitheann sé sin ar fháil a bheith ar cheann

source: Your GP (family doctor) or the Health Service Executive will advise you of the nearest maternity hospital(s), and will supply you with a letter of referral
ga: Tabharfaidh do Dhochtúir Teaghlaigh nó Feiidhmeannacht na Seirbhíse Sláinte comhairle duit maidir leis an ospidéal/na hospidéil máithreachais is gaire duit, agus tabharfaidh sé/sí litir chur ar aghaidh duit

source: You can telephone the hospital directly for a first appointment
ga: Is féidir leat glaoch go díreach ar an ospidéal i gcomhair an chéad choinne
